"""
Необходимо создать (не программно) текстовый файл, где каждая строка описывает учебный предмет и наличие лекционных,
практических и лабораторных занятий по этому предмету и их количество. Важно, чтобы для каждого предмета не обязательно
были все типы занятий. Сформировать словарь, содержащий название предмета и общее количество занятий по нему. Вывести
словарь на экран.
Примеры строк файла:

Информатика: 100(л) 50(пр) 20(лаб).
Физика: 30(л) — 10(лаб)
Физкультура: — 30(пр) —
Пример словаря:

{“Информатика”: 170, “Физика”: 40, “Физкультура”: 30}
"""

subject_dict = {}
with open("task_6.txt", "r") as f:
    for line in f:
        subject = line.split(':')[0]
        hours = sum([int(el.split("(")[0]) for el in line.split(":")[1].split(" ") if el.split("(")[0].isdigit()])
        subject_dict[subject] = hours
print(subject_dict)
